#include<stdio.h>
/*表达式的整型运算要在CPU的相应运算器件内执行，CPU内整型运算器(ALU)的操作数的字节长度
一般就是int的字节长度，同时也是CPU的通用寄存器的长度。
因此，即使两个char类型的相加，在CPU执行时实际上也要先转换为CPU内整型操作数的标准长
度。
通用CPU（general-purpose CPU）是难以直接实现两个8比特字节直接相加运算（虽然机器指令
中可能有这种字节相加指令）。所以，表达式中各种长度可能小于int长度的整型值，都必须先转
换为int或unsigned int，然后才能送入CPU去执行运算。*/
int main()
{
	char c=1;
	printf("%u\n",sizeof(c));
	printf("%u\n",sizeof(+c));
	printf("%u\n",sizeof(!c));
	//只要参与运算 就提升为整形
	char a=5;
	char b=127;
	char d=0;
	d=a+b;
	printf("%d\n",d);//-124
	//a--00000101---参与计算 提升为整形--00000000000000000000000000000101
	//b-01111111--00000000000000000000000001111111
	//a+b
	//10000100 
	//00000000000000000000000000000101
	//00000000000000000000000001111111
	//11111111111111111111111110000100--补码 
	//11111111111111111111111110000011--反码
	//10000000000000000000000001111100--原码 ==-124
	return 0;
}
